app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all

INSERT INTO "issues" ("user_id", "title", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 17], ["title", "Test Issue"], ["category", "Test Category"], ["created_at", 2017-02-21 12:07:34 UTC], ["updated_at", 2017-02-21 12:07:34 UTC]]
---
    def create
      @issue = Issue.new(issue_params)
      if @issue.save

UPDATE "issues" SET "category" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["category", "racism"], ["updated_at", 2017-02-21 11:50:59 UTC], ["id", 8]]
---
    def update
      if @issue.update(issue_params)

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_issue
      @issue = Issue.find(params[:id])