app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    if @message.save
---
INSERT INTO "messages" ("sender_id", "receiver_id", "msg_text", "created_at", "updated_at", "issue_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sender_id", 19], ["receiver_id", 19], ["msg_text", "A message to be added to issue 13"], ["created_at", 2017-02-21 14:23:04 UTC], ["updated_at", 2017-02-21 14:23:04 UTC], ["issue_id", 13]]

  def update
    if @message.update(message_params)
---
UPDATE "messages" SET "sender_id" = $1, "msg_text" = $2, "updated_at" = $3 WHERE "messages"."id" = $4  [["sender_id", 45], ["msg_text", "Thank you for the advice"], ["updated_at", 2017-02-22 17:16:38 UTC], ["id", 124]]