app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "sector" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["sector", "Fashion"], ["updated_at", 2017-02-21 11:29:15 UTC], ["id", 17]]